# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [ ]:
import pandas as pd
import numpy as np
import swifter

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [18]:
url = r'C:\Users\凌\Desktop\Py\pandas练习题\pandas_exercises\06_Stats\US_Baby_Names\US_Baby_Names_right.csv'
baby_names = pd.read_csv(url, sep=',')

In [3]:
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
Unnamed: 0    1016395 non-null int64
Id            1016395 non-null int64
Name          1016395 non-null object
Year          1016395 non-null int64
Gender        1016395 non-null object
State         1016395 non-null object
Count         1016395 non-null int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

### Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [6]:
baby_names.drop(['Unnamed: 0', 'Id'], axis=1)

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Are there more male or female names in the dataset?

In [8]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [19]:
baby_names.drop(['Year'], axis=1, inplace=True)

names = baby_names.groupby(by='Name').sum()

names.head()

print(names.shape)

names.sort_values('Count', ascending = False).head()

(17632, 3)

          Unnamed: 0          Id   Count
Name
Jacob     1665680788  1665681356  242874
Emma      1629481684  1629482250  214852
Michael   1687520717  1687521295  214405
Ethan     1660807908  1660808475  209277
Isabella  1630131220  1630131786  204798

### Step 8. How many different names exist in the dataset?

In [20]:
len(names)

17632

### Step 9. What is the name with most occurrences?

In [30]:
names.Count.idxmax()

'Jacob'

### Step 10. How many different names have the least occurrences?

In [36]:
len(names[names.Count == names.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [37]:
names[names.Count == names.Count.median()]

         Unnamed: 0        Id  Count
Name
Aishani     7810519   7810526     49
Alara      18841019  18841027     49
Alysse     22629397  22629405     49
Ameir      21780403  21780411     49
Anely       4349533   4349541     49
...             ...       ...    ...
Sriram      9208196   9208203     49
Trinton    32822294  32822302     49
Vita       10241625  10241632     49
Yoni        6439146   6439154     49
Zuleima     3521366   3521373     49

[66 rows x 3 columns]

### Step 12. What is the standard deviation of names?

In [38]:
names.Count.std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [39]:
names.describe()

         Unnamed: 0            Id          Count
count  1.763200e+04  1.763200e+04   17632.000000
mean   1.631922e+08  1.631922e+08    2008.932169
std    3.504512e+08  3.504513e+08   11006.069468
min    8.606400e+04  8.606500e+04       5.000000
25%    4.918374e+06  4.918375e+06      11.000000
50%    1.963462e+07  1.963463e+07      49.000000
75%    1.071826e+08  1.071826e+08     337.000000
max    3.223035e+09  3.223036e+09  242874.000000